// Напишите программу, которая на вход принимает два целых 
// числа и проверяет, является ли первое число квадратом второго.

int first = 25;
int second = 5;

if (second * second == first)
{
    Console.WriteLine("Yes");
}
else
{
    Console.WriteLine("No");
}