// Вывести все чётные числа от 1 до n.

int evenNumbers = 23;

for (int i = 2; i <= evenNumbers; i = i + 2)
{
    Console.WriteLine(i + " ");
}