// Напишите программу, которая на вход принимает число number и выводит,
// является ли число чётным (делится ли оно на два без остатка).

int number = 7;

if (number % 2 == 0)
{
    Console.WriteLine("Чётное");
}
else
{
    Console.WriteLine("Нечётное");
}
