// Напишите программу, которая на вход принимает два числа и выводит, какое число большее, а какое меньшее.

int firstNumber = 8;
int secondNumber = 6;

if (firstNumber > secondNumber)
{
    Console.WriteLine("Первое число больше");
}
else if (firstNumber == secondNumber)
{
    Console.WriteLine("Числа равны");
}
else
{
    Console.WriteLine("Второе число больше");
}